Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.AbortSaveToCentral
Aborts the current save to central operation by setting the isReadySaveToCentral flag to false.
Remarks:
Calling this method will prevent the document from being saved to central
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.EnableWorksharing
Is this commit to convert the model to worksharing model?
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.ExtraResource
Extra resource for the save to central operation.
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.LatestModelVersion
center model latest version in history table
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.LatestEpisodeGuid
center model latest episode GUID
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.SaveToCentralStage
The stage of the save to central operation.
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.IsReadySaveToCentral
Flag indicating whether to continue the current SaveToCentral operation.
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs)
Creates a copy of the DocumentReadyToSaveToCentralEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Events.DocumentReadyToSaveToCentralEventArgs
The event arguments used by the DocumentReadyToSaveToCentral event.
Remarks:
This event is raised when Revit determines that a document is ready to be saved to the central model.
Since:
2027